# GetAngleToNorth

## Description
Get angle to north.

```pascal
FUNCTION GetAngleToNorth : REAL;
```

```python
def vs.GetAngleToNorth():
    return REAL
```

## Examples
```pascal
resultVal := GetAngleToNorth;
```
```python
import vs

# Get angle to north.
angle = vs.GetAngleToNorth()
vs.Message('GetAngleToNorth returned: ' + str(angle))
```

## Version
Availability: from Vectorworks 2012

## Category
* GIS